app/Controllers/AdminController.php

    public function management()
    {

        $voters = $this->userModel->findAll();
        $elections = $this->electionModel->orderBy('election_id', 'DESC')->first();
        $results = $this->voteModel->select('votes_table.*, candidates_table.*, count(*) as vote_count')
                    ->join('candidates_table', 'votes_table.candidate_id = candidates_table.candidate_id')
                    ->where('candidates_table.election_id', $elections['election_id'])
                    ->groupBy('votes_table.candidate_id')
                    ->findAll();
---
SELECT *
FROM `users`
SELECT `votes_table`.*, `candidates_table`.*, count(*) as vote_count
FROM `votes_table`
JOIN `candidates_table` ON `votes_table`.`candidate_id` = `candidates_table`.`candidate_id`
WHERE `candidates_table`.`election_id` = '1'
GROUP BY `votes_table`.`candidate_id`

    public function voters()
    {
        // Fetch all users from the UserModel
        $voters = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function results()
    {
        $elections = $this->electionModel->orderBy('election_id', 'DESC')->findAll();

        $allResults = [];
        foreach ($elections as $election) {
            $results = $this->voteModel
                ->select('candidates_table.candidate_id, candidates_table.candidate_first_name, candidates_table.candidate_last_name, candidates_table.candidate_position, COUNT(*) as vote_count')
                ->join('candidates_table', 'votes_table.candidate_id = candidates_table.candidate_id')
                ->where('candidates_table.election_id', $election['election_id'])
                ->groupBy('votes_table.candidate_id')
                ->findAll();
---
SELECT `candidates_table`.`candidate_id`, `candidates_table`.`candidate_first_name`, `candidates_table`.`candidate_last_name`, `candidates_table`.`candidate_position`, COUNT(*) as vote_count
FROM `votes_table`
JOIN `candidates_table` ON `votes_table`.`candidate_id` = `candidates_table`.`candidate_id`
WHERE `candidates_table`.`election_id` = '1'
GROUP BY `votes_table`.`candidate_id`