app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'Name.php@gmail.com'
 LIMIT 1
---
    public function process_login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();