app/Controllers/Home.php

    public function user_page()
    {
        //User Model to get user data
        $user_id = session()->get('user_id');
        $user = $this->userModel->find($user_id);

        // Election Model to get election data
        $elections = $this->electionModel->orderBy('election_id', 'DESC')->findAll();


        // Candidates Model to get candidates data
        $president = $this->candidatesModel->getCandidatesByPosition('President');
        $vice_president = $this->candidatesModel->getCandidatesByPosition('Vice-President');
        $secretary = $this->candidatesModel->getCandidatesByPosition('Secretary');
        $treasurer = $this->candidatesModel->getCandidatesByPosition('Treasurer');
        $auditor = $this->candidatesModel->getCandidatesByPosition('Auditor');

        // Get election results for each election
        $results = [];
        foreach ($elections as $election) {
            $results[$election['election_id']] = $this->votesModel
                ->select('candidates_table.candidate_id, candidates_table.candidate_first_name, candidates_table.candidate_last_name, candidates_table.candidate_position, COUNT(*) as vote_count')
                ->join('candidates_table', 'votes_table.candidate_id = candidates_table.candidate_id')
                ->where('candidates_table.election_id', $election['election_id'])
                ->groupBy('votes_table.candidate_id')
                ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '6'
SELECT `candidates_table`.`candidate_id`, `candidates_table`.`candidate_first_name`, `candidates_table`.`candidate_last_name`, `candidates_table`.`candidate_position`, COUNT(*) as vote_count
FROM `votes_table`
JOIN `candidates_table` ON `votes_table`.`candidate_id` = `candidates_table`.`candidate_id`
WHERE `candidates_table`.`election_id` = '1'
GROUP BY `votes_table`.`candidate_id`